{--референс (процедуры, циклы, ветвления, переменные, и прочие фишки, связанные с интерпретатором команд)
}
{--перемещение по папкам и просмотр папок
}
{--редактирование папок
}
{--просмотр текста
}
{--ручное редактирование текста
}
{--автоматическое редактирование и обработка текста
}
{--установка и удаление пакетов команд и программ
}
{--справка
}
--...
{--архиваторы
}
{--системы контроля версий (контроль файлов)
}
{--сеть и интернет
}
{--прочее общее администрирование системы 
	(дата-время, включение, выключение компа
	управление процессами
	пользователи, права, сопоставления файлов, 
	начальная загрузка, 
	драйвера, 
	диски)
}
{--модели одних систем в других системах
}
--...
{--наборы компиляторов
}
{--иде
}
{--автотулс
}
{--скриптовые языки
}
