//-------------------------------------------------------------
// ПО обслуживания PWM
//-------------------------------------------------------------

#include "board.h"
#include "lib_pwm.h"

U8 r10000=0;  //------------------------------------
U8 r1000=0;   //
U8 r100=0;    //  разряды десятичного числа
U8 r10=0;     //
U8 r1=0;      //------------------------------------

//----------------------------------------------------------------------------
// Функция инициализации PWM
//----------------------------------------------------------------------------
void AT91F_PWM_Open(U8 SIGN_SINHR, U8 DIVIDER)
{
    //Разрешение выхода PWM в контроллере PIO (PA11, канал 0 PWM)
        AT91F_PIO_CfgPeriph(AT91C_BASE_PIOA, 0, AT91C_PA11_PWM0);

    //Разрешение синхронизации PWM
        AT91F_PWMC_CfgPMC ();

    //Остановка канала 0 PWM
        AT91F_PWMC_StopChannel(AT91C_BASE_PWMC,AT91C_PWMC_CHID0);

    //Установки делителя A (выбор источника синхрочастоты и задание коэфф деления делителя)
        AT91C_BASE_PWMC->PWMC_MR = (( SIGN_SINHR << 8 ) | DIVIDER);
}

//----------------------------------------------------------------------------
// Функция настройки канала 0 PWM
//----------------------------------------------------------------------------
void AT91F_Set_PWM_Channel0(U16 PERIOD, U16 DUTY)
{
        //         - используется делитель A
	//         - CALG=0 выравнивание по левой границе
	//         - CPOL=1 старт с высокого уровня
 	AT91C_BASE_PWMC_CH0->PWMC_CMR = AT91C_PWMC_CPRE_MCKA | CPOL_ON | CALG_OFF ;

    //активизация заданных установок мгновенно
            AT91C_BASE_PWMC_CH0->PWMC_CPRDR = PERIOD; //период
	    AT91C_BASE_PWMC_CH0->PWMC_CDTYR = DUTY;   //рабочий цикл

    //запуск канала  0 PWM
        AT91F_PWMC_StartChannel(AT91C_BASE_PWMC,AT91C_PWMC_CHID0);
}

//----------------------------------------------------------------------------
//Функция корректной активации периода PWM
//----------------------------------------------------------------------------
void AT91F_Set_PWM_Channel0_period(U16 PERIOD)
{
    //подготовиться к активации периода PWM
     AT91C_BASE_PWMC_CH0->PWMC_CMR = AT91C_PWMC_CPRE_MCKA | CPD_ON | CPOL_ON | CALG_OFF ;

   //произвести активизацию заданных установок (периода) в конце текущего периода
     AT91C_BASE_PWMC_CH0->PWMC_CUPDR = PERIOD;
}

//----------------------------------------------------------------------------
//Функция корректной активации рабочего цикла (длит импульса) PWM
//----------------------------------------------------------------------------
void AT91F_Set_PWM_Channel0_duty(U16 DUTY)
{
    //подготовиться к активации рабочего цикла PWM
     AT91C_BASE_PWMC_CH0->PWMC_CMR = AT91C_PWMC_CPRE_MCKA | CPD_OFF | CPOL_ON | CALG_OFF ;

   //произвести активизацию заданных установок (рабочего цикла) в конце текущего периода
     AT91C_BASE_PWMC_CH0->PWMC_CUPDR = DUTY;
}

//----------------------------------------------------------------------------
//Функция индикации значения делителя синхрочастоты PWM
//----------------------------------------------------------------------------
void Ind_DIVID(U8 DIV)
           {
            U8 DIV_IND = 0;
            DIV_IND = DIV;

            r100 = DIV_IND / 100;
            DIV_IND = DIV_IND % 100;
            r10 = DIV_IND / 10;
            r1 = DIV_IND % 10;
            lcd_pro_data(r100,64);
            lcd_tek_data(r10);
            lcd_tek_data(r1);
           }

//---------------------------------------------------------------------
//Функция индикации значения периода PWM
//---------------------------------------------------------------------
void  Ind_PERIOD(U16 PER_SIZE)
            {
            U16 PERIOD_IND = 0;
            PERIOD_IND = PER_SIZE;

            r10000 = PERIOD_IND / 10000;
            PERIOD_IND = PERIOD_IND % 10000;
            r1000 = PERIOD_IND / 1000;
            PERIOD_IND = PERIOD_IND % 1000;
            r100 = PERIOD_IND / 100;
            PERIOD_IND = PERIOD_IND % 100;
            r10 = PERIOD_IND / 10;
            r1 = PERIOD_IND % 10;
            lcd_pro_data(r10000,68);
            lcd_tek_data(r1000);
            lcd_tek_data(r100);
            lcd_tek_data(r10);
            lcd_tek_data(r1);
            }

//--------------------------------------------------------------------------
//Функция индикации значения рабочего цикла PWM
//--------------------------------------------------------------------------
void Ind_DUTY(U16 DUT_SIZE)
            {
            U16 DUTY_IND = 0;
            DUTY_IND = DUT_SIZE;

            r10000 = DUTY_IND / 10000;
            DUTY_IND = DUTY_IND % 10000;
            r1000 = DUTY_IND / 1000;
            DUTY_IND = DUTY_IND % 1000;
            r100 = DUTY_IND / 100;
            DUTY_IND = DUTY_IND % 100;
            r10 = DUTY_IND / 10;
            r1 = DUTY_IND % 10;
            lcd_pro_data(r10000,74);
            lcd_tek_data(r1000);
            lcd_tek_data(r100);
            lcd_tek_data(r10);
            lcd_tek_data(r1);
            }

