MSVCDir
	C:\Program Files\Microsoft Visual Studio 9.0\
== Макросы ==
ConfigurationName
	Debug
DevEnvDir
	$(MSVCDir)Common7\IDE\
FrameworkDir
	C:\WINDOWS\Microsoft.NET\Framework\
FrameworkSDKDir
	C:\Program Files\Microsoft SDKs\Windows\v6.0A\
FrameworkVersion
	v2.0.50727
FxCopDir
	$(MSVCDir)Team Tools\Static Analysis Tools\FxCop\
	
================================
{общие свойства
{.NET Framework и ссылки
}
}
{свойства конфигурации
{общие
{значения по умолчанию для проэкта
тип конфигурации
	makefile
	приложение
	динамическая библиотека
	статическая библиотека
	служебная программа
использование MFC
	стандартные библиотеки windows
	MFC в статической библиотеке
	MFC в общей dll
использование ATL
	без использования
	статическая компоновка
	динамическая компоновка
набор знаков
	не задано
	использовать юникод-кодировку
	тспользовать многобайтовую кодировку
поддержка CLR-среды
	нет поддержки
	есть поддержка (/clr)
	CLR-поддержка чистого MSIL (/clr:pure)
	CLR-поддержка безопасного MSIL (/clr:safe)
	CLR-поддержка: старый синтаксис (/clr:oldSyntax)
оптимизация все программы
	нет оптимизации всех программы
	использовать создание кода во время компоновки
	управляемая профилем оптимизация - интструмент
	ведомая профилем оптимизация - оптимизация
	ведомая профилем оптимизация - обновление
}
{общие
выходной каталог
	$(SolutionDir)$(ConfigurationName)
промежуточный каталог
	$(ConfigurationName)
расширения, которые нужно удалять при очистке
	*.obj
	*.ilk
	*.tlb
	*.tli
	*.tlh
	*.tmp
	*.rsp
	*.pgc
	*.pgd
	*.meta
	$(TargetPath)
	
}
}
{отладка
}
{с/с++
{общие
}{оптимизация
}{препроцессор
}{создание кода
}{язык
}{предварительно скомпилированные заголовки
}{выходные файлы
}{информация об исходном коде
}{дополнительно
}{командная строка
}
}
{компоновщик
{общие
}{ввод
}{файл манифеста
}{отладка
}{система
}{оптимизация
}{внедренный IDL
}{дополнительно
}{командная строка
}
}
{инструмент манифеста
{общие
}{вход и выход
}{изолированный COM
}{дополнительно
}{командная строка
}
}
{средство создания XML-документов
{общие
}{командная строка
}
}
{информация об исходном коде
{общие
}{командная строка
}
}
{события построения
{события перед построением
}{собыьтия перед компоновкой
}{события после построения
}
}
{настраиваемый этап построения
{общие
}
}
{анализ кода
{общие
}{правила анализа управляемого кода
}
}
{верификатор приложений
{общие
}
}
